import Foundation

public class JapaneseDateConverter {
    
    public init() {
        dateFormatter = DateFormatter()
        dateFormatter.calendar = Calendar(identifier: .gregorian)
        dateFormatter.timeZone = TimeZone(identifier: "ja_JP")
        dateFormatter.locale = Locale(identifier: "Asia/Tokyo")
    }
    
    let dateFormatter: DateFormatter

    let setsOfRegularExpressionAndUnicode35DateFormat = [
        
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時[0-9][0-9]分[0-9][0-9]秒$", "unicode35": "yyyy年MM月dd日HH時mm分ss秒"],

        ["regex": "^[0-9]{4}年[0-9]月[0-9]日[0-9]時$", "unicode35": "yyyy年M月d日H時"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9]日[0-9][0-9]時$", "unicode35": "yyyy年M月d日HH時"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9]日[0-9]時[0-9]分$", "unicode35": "yyyy年M月d日H時m分"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "yyyy年M月d日HH時m分"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "yyyy年M月d日H時mm分"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "yyyy年M月d日HH時mm分"],

        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日[0-9]時$", "unicode35": "yyyy年MM月d日H時"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日[0-9][0-9]時$", "unicode35": "yyyy年MM月d日HH時"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日[0-9]時[0-9]分$", "unicode35": "yyyy年MM月d日H時m分"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "yyyy年MM月d日HH時m分"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "yyyy年MM月d日H時mm分"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "yyyy年MM月d日HH時mm分"],

        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日[0-9]時$", "unicode35": "yyyy年M月dd日H時"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日[0-9][0-9]時$", "unicode35": "yyyy年M月dd日HH時"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日[0-9]時[0-9]分$", "unicode35": "yyyy年M月dd日H時m分"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "yyyy年M月dd日HH時m分"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "yyyy年M月dd日H時mm分"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "yyyy年M月dd日HH時mm分"],

        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9]時$", "unicode35": "yyyy年MM月dd日H時"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時$", "unicode35": "yyyy年MM月dd日HH時"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9]時[0-9]分$", "unicode35": "yyyy年MM月dd日H時m分"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "yyyy年MM月dd日HH時m分"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "yyyy年MM月dd日H時mm分"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "yyyy年MM月dd日HH時mm分"],

        ["regex": "^[0-9]{4}年[0-9]月[0-9]日$", "unicode35": "yyyy年M月d日"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9]日$", "unicode35": "yyyy年MM月d日"],
        ["regex": "^[0-9]{4}年[0-9]月[0-9][0-9]日$", "unicode35": "yyyy年M月dd日"],
        ["regex": "^[0-9]{4}年[0-9][0-9]月[0-9][0-9]日$", "unicode35": "yyyy年MM月dd日"],
//        ["regex": "^[0-9]{4}年[0-9]月$", "unicode35": "yyyy年M月"],
//        ["regex": "^[0-9]{4}年[0-9][0-9]月$", "unicode35": "yyyy年MM月"],

        ["regex": "^[0-9]月[0-9]日[0-9]時$", "unicode35": "M月d日H時"],
        ["regex": "^[0-9]月[0-9]日[0-9][0-9]時$", "unicode35": "M月d日HH時"],
        ["regex": "^[0-9]月[0-9]日[0-9]時[0-9]分$", "unicode35": "M月d日H時m分"],
        ["regex": "^[0-9]月[0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "M月d日HH時m分"],
        ["regex": "^[0-9]月[0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "M月d日H時mm分"],
        ["regex": "^[0-9]月[0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "M月d日HH時mm分"],

        ["regex": "^[0-9][0-9]月[0-9]日[0-9]時$", "unicode35": "MM月d日H時"],
        ["regex": "^[0-9][0-9]月[0-9]日[0-9][0-9]時$", "unicode35": "MM月d日HH時"],
        ["regex": "^[0-9][0-9]月[0-9]日[0-9]時[0-9]分$", "unicode35": "MM月d日H時m分"],
        ["regex": "^[0-9][0-9]月[0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "MM月d日HH時m分"],
        ["regex": "^[0-9][0-9]月[0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "MM月d日H時mm分"],
        ["regex": "^[0-9][0-9]月[0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "MM月d日HH時mm分"],

        ["regex": "^[0-9]月[0-9][0-9]日[0-9]時$", "unicode35": "M月dd日H時"],
        ["regex": "^[0-9]月[0-9][0-9]日[0-9][0-9]時$", "unicode35": "M月dd日HH時"],
        ["regex": "^[0-9]月[0-9][0-9]日[0-9]時[0-9]分$", "unicode35": "M月dd日H時m分"],
        ["regex": "^[0-9]月[0-9][0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "M月dd日HH時m分"],
        ["regex": "^[0-9]月[0-9][0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "M月dd日H時mm分"],
        ["regex": "^[0-9]月[0-9][0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "M月dd日HH時mm分"],

        ["regex": "^[0-9][0-9]月[0-9][0-9]日[0-9]時$", "unicode35": "MM月dd日H時"],
        ["regex": "^[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時$", "unicode35": "MM月dd日HH時"],
        ["regex": "^[0-9][0-9]月[0-9][0-9]日[0-9]時[0-9]分$", "unicode35": "MM月dd日H時m分"],
        ["regex": "^[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "MM月dd日HH時m分"],
        ["regex": "^[0-9][0-9]月[0-9][0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "MM月dd日H時mm分"],
        ["regex": "^[0-9][0-9]月[0-9][0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "MM月dd日HH時mm分"],

        ["regex": "^[0-9]月[0-9]日$", "unicode35": "M月d日"],
        ["regex": "^[0-9][0-9]月[0-9]日$", "unicode35": "MM月d日"],
        ["regex": "^[0-9]月[0-9][0-9]日$", "unicode35": "M月dd日"],
        ["regex": "^[0-9][0-9]月[0-9][0-9]日$", "unicode35": "MM月dd日"],
//        ["regex": "^[0-9]月$", "unicode35": "M月"],
//        ["regex": "^[0-9][0-9]月$", "unicode35": "MM月"],

        ["regex": "^[0-9]日[0-9]時$", "unicode35": "d日H時"],
        ["regex": "^[0-9]日[0-9][0-9]時$", "unicode35": "d日HH時"],
        ["regex": "^[0-9]日[0-9]時[0-9]分$", "unicode35": "d日H時m分"],
        ["regex": "^[0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "d日HH時m分"],
        ["regex": "^[0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "d日H時mm分"],
        ["regex": "^[0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "d日HH時mm分"],

        ["regex": "^[0-9][0-9]日[0-9]時$", "unicode35": "dd日H時"],
        ["regex": "^[0-9][0-9]日[0-9][0-9]時$", "unicode35": "dd日HH時"],
        ["regex": "^[0-9][0-9]日[0-9]時[0-9]分$", "unicode35": "dd日H時m分"],
        ["regex": "^[0-9][0-9]日[0-9][0-9]時[0-9]分$", "unicode35": "dd日HH時m分"],
        ["regex": "^[0-9][0-9]日[0-9]時[0-9][0-9]分$", "unicode35": "dd日H時mm分"],
        ["regex": "^[0-9][0-9]日[0-9][0-9]時[0-9][0-9]分$", "unicode35": "dd日HH時mm分"],

        ["regex": "^[0-9]日$", "unicode35": "d日"],
        ["regex": "^[0-9][0-9]日$", "unicode35": "dd日"],
        ["regex": "^[0-9]時$", "unicode35": "H時"],
        ["regex": "^[0-9][0-9]時$", "unicode35": "HH時"],
        ["regex": "^[0-9]時[0-9]分$", "unicode35": "H時m分"],
        ["regex": "^[0-9][0-9]時[0-9]分$", "unicode35": "HH時m分"],
        ["regex": "^[0-9]時[0-9][0-9]分$", "unicode35": "H時mm分"],
        ["regex": "^[0-9][0-9]時[0-9][0-9]分$", "unicode35": "HH時mm分"]
        
    ]
    
}

